PM

期間：2023年1月 – 現在（6ヶ月）

プロジェクト内容
・ 顧客基幹システムリプレイス

#概要
・顧客がこれまで業務で使用していた基幹システムをクラウドサービスへリプレイスする。

担当フェーズ
・要件定義
・基本設計
・詳細設計
・プログラミング
・単体テスト
・結合テスト
・システムテスト
・受け入れテスト
・保守・運用
・導入

【実績・取り組み】
【要件定義について】
・前任者が不在となったプロジェクトであり、要件定義が曖昧な状態で開発が始まってしまっていた。顧客とのMTGを行い要件定義から開発を仕切り直した。
・既存システムが20年ほど前に作成されており、システムのドキュメントを紛失していたため、ソースコードからのリバースエンジニアリングを行い、既存システムの仕様を明確にした。
・明確にした仕様を元に要件定義を行った。
・VB6やSQL2000を使用しており、既存システムの調査環境の構築に苦心した。VirtualBoxのWindowsXP環境やDocker環境を構築し、SQL2008→SQL2019と段階的にデータベースのリストアを行うことで解決した。
・顧客側にシステムエンジニアが不在のため要件定義仕様書のみでは仕様の読み合わせができなかった。そのためAdobeXDを使用し簡易デザインの作成やドメインモデル図を作成し視覚的に仕様を表現した読み合わせを実施している。
 ・テキストベースでは顧客からのFBが皆無だったが、視覚的な対策を行なって以降は活発にコミュニケーションを取れるようになった。

【開発について】
現在開発中のため未記載

環境
・macOS
・PostgreSQL
・Next.js
・Nest.js
・Docker

役割／規模
・PM
・8人

PM

期間：2022年10月 – 2023年1月

プロジェクト内容
運送業界向けSaas開発

概要
運送効率を改善することを目的としたSaas開発及び、DX化を推進する。

担当フェーズ
・要件定義
・基本設計
・詳細設計
・プログラミング
・単体テスト
・結合テスト
・システムテスト
・受け入れテスト
・保守・運用
・導入

【実績・取り組み】
・要求が明確になるようにヒアリングを密に行っている。
・社内の業務プロセスの改善も併せておこなっており、生産性の向上/ソフトウェア品質の向上を図っている。

環境
・macOS
・PostgreSQL
・Go
・HTML
・CSS
・Nuxt.js
・Docker

役割／規模
・PM
10人

テストリーダー/エンジニア

期間：2022年6月 – 2022年10月

プロジェクト内容
自動車業界向けWEBアプリ開発

概要
機能の修正と新規機能追加

担当フェーズ
・要件定義
・基本設計
・詳細設計
・プログラミング
・単体テスト
・結合テスト
・システムテスト
・受け入れテスト
・保守・運用

【実績・取り組み】
・途中参画による取り組み
 ・すでに開発が進んでいるプロジェクトだったが、要件定義に漏れや曖昧な箇所が多く、スタッフ側からボトムアップ方式で指摘や要件の明確化を行った。
 ・技術のキャッチアップをしながら品質を高めるためにプロジェクトの課題や問題の洗い出しを行った。
 ・ヒアリングを密に行うことで顧客が不満としていた要求の明確化や納品物の品質向上に貢献した。
・開発体制改善について
・品質を担保するために開発体制の改善に取り組んだ。
・コードレビューの導入
 ・レビュアーを務め、プルリクエストをマージする前に必ずレビューを行う仕組みづくりを行った。
 ・単体テスト、結合テストの改善
・ 各個人で行なっていた動作テストのみではなく、機能単位でテスト項目を作成し、正しい仕様とそれを確認するためにはどういった検証が必要なのか明記したテスト仕様書を作成するようにした。
 ・要件の明確化
 ・画面ベースで開発を行っており、開発ドキュメント不足していた。顧客と開発者へのヒアリングを行いドキュメントのメンテナンスを行った。

環境
・macOS
・iOS
・Android
・PostgreSQL
・Java
・JQuery
・Vue
・SpringBoot
・Bootstrap
・HTML
・CSS
・flutter

役割／規模
・スタッフ
・テストリーダー
・人員管理
・進捗管理
・品質管理